app/Controllers/Compras.php

    public function listar()
{
    $db = \Config\Database::connect();
    $builder = $db->table('compras');
    $builder->select('compras.id_compra, compras.id_producto, compras.cantidad, compras.fecha, productos.nombre as nombre_producto');
    $builder->join('productos', 'productos.id_producto = compras.id_producto');
    $query = $builder->get();
---
SELECT `compras`.`id_compra`, `compras`.`id_producto`, `compras`.`cantidad`, `compras`.`fecha`, `productos`.`nombre` as `nombre_producto`
FROM `compras`
JOIN `productos` ON `productos`.`id_producto` = `compras`.`id_producto`