app/Controllers/Login.php

    public function autenticar()
    {
        // Recoge los datos enviados por el formulario vía POST
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Busca al usuario en la base de datos por su email
        $usuario = $this->usuarioModel->where('email', $email)->first();
---
SELECT *
FROM `tbl_usuarios`
WHERE `email` = 'luis@gmail.com'
 LIMIT 1