app/Controllers/Productos.php

UPDATE `productos` SET `nombre` = 'Smartphone Samsung Galaxy S23', `descripcion` = '', `precio` = '1200.00', `stock` = '20'
WHERE `productos`.`id_producto` IN ('2')
---
public function actualizar($id = null)
{
    $producto = $this->productoModel->find($id);

    if (!$producto) {
        throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Producto no encontrado: $id");
    }

    $datos = [
        'nombre' => $this->request->getPost('nombre'),
        'descripcion' => $this->request->getPost('descripcion'),
        'precio' => $this->request->getPost('precio'),
        'stock' => $this->request->getPost('stock'),
    ];

    $this->productoModel->update($id, $datos);