app/Controllers/Usuarios.php

    public function index()
    {
        // Se obtienen todos los usuarios de la base de datos
        $data['usuarios'] = $this->usuarioModel->findAll();
---
SELECT *
FROM `tbl_usuarios`

    public function registrar()
    {
        // Recoge los datos del formulario enviados por POST
        $nombre = $this->request->getPost('nombre');
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Valida que los campos no estén vacíos
        if (!$nombre || !$email || !$password) {
            return redirect()->back()->with('error', 'Todos los campos son obligatorios.');
        }

        // Verifica si ya existe un usuario con el mismo correo
        $existe = $this->usuarioModel->where('email', $email)->first();
---
SELECT *
FROM `tbl_usuarios`
WHERE `email` = 'maria@gmail.com'
 LIMIT 1