app/Models/ProductoModel.php

SELECT *
FROM `productos`
---
    public function obtenerProductos()
    {
        return $this->findAll();